// Вычислите сумму членов последовательности, начинающейся с единицы, 
// в которой каждый следующий член в три раза больше предыдущего,
// т.е. {1, 3, 9, 27, 81,…}, причем последний член последовательности не должен превышать 1000.





// Сформируйте массив целых чисел по алгоритму Фибоначчи: 
// 1-й и 2-й элемент равны 1, а каждый последующий равен сумме двух предыдущих, 
// т.е.: 1, 1, 2, 3, 5, 8, … . Найдите сумму и произведение его N членов.





// Задан массив целых чисел A[20]. Создать другой массив целых чисел B[ ], 
// в который войдут все числа исходного массива, 
// удовлетворяющие условию: А[i] <= 888, после чего отсортировать элементы массива В[ ] по убыванию




// Задано три треугольника со своими сторонами (a, b, c). 
// Найти треугольник с наибольшим периметром или наибольшей площадью. 
// Всегда ли это будет один и тот же треугольник?